In [2]:
import pandas as pd

In [3]:
data = {'A':[25,56,93], 'B': ['str1','str2','str3'] }

In [4]:
df = pd.DataFrame(data)

In [5]:
df

    A     B
0  25  str1
1  56  str2
2  93  str3

In [6]:
# 0,1,2 index create automically

In [7]:
df = pd.DataFrame(data, index=['a','b','c'])

In [8]:
df

    A     B
a  25  str1
b  56  str2
c  93  str3

In [9]:
df = pd.DataFrame(data)
df = df.set_index('A')

In [10]:
df

       B
A
25  str1
56  str2
93  str3

In [11]:
filename = '../data/beer/beers.csv'
data = pd.read_csv(filename)

In [12]:
df = pd.DataFrame(data)

In [13]:
df.set_index('Unnamed: 0')

,abv,ibu,id,name,style,brewery_id,ounces
Unnamed: 0,,,,,,,
0,0.050,NaN,1436,Pub Beer,American Pale Lager,408,12.0
1,0.066,NaN,2265,Devil's Cup,American Pale Ale (APA),177,12.0
2,0.071,NaN,2264,Rise of the Phoenix,American IPA,177,12.0
3,0.090,NaN,2263,Sinister,American Double / Imperial IPA,177,12.0
4,0.075,NaN,2262,Sex and Candy,American IPA,177,12.0
...,...,...,...,...,...,...,...
2405,0.067,45.0,928,Belgorado,Belgian IPA,424,12.0
2406,0.052,NaN,807,Rail Yard Ale,American Amber / Red Ale,424,12.0
2407,0.055,NaN,620,B3K Black Lager,Schwarzbier,424,12.0
2408,0.055,40.0,145,Silverback Pale Ale,American Pale Ale (APA),424,12.0
2409,0.052,NaN,84,Rail Yard Ale (2009),American Amber / Red Ale,424,12.0

In [14]:
df.head()

,Unnamed: 0,abv,ibu,id,name,style,brewery_id,ounces
0,0,0.050,NaN,1436,Pub Beer,American Pale Lager,408,12.0
1,1,0.066,NaN,2265,Devil's Cup,American Pale Ale (APA),177,12.0
2,2,0.071,NaN,2264,Rise of the Phoenix,American IPA,177,12.0
3,3,0.090,NaN,2263,Sinister,American Double / Imperial IPA,177,12.0
4,4,0.075,NaN,2262,Sex and Candy,American IPA,177,12.0

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2410 entries, 0 to 2409
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  2410 non-null   int64
 1   abv         2348 non-null   float64
 2   ibu         1405 non-null   float64
 3   id          2410 non-null   int64
 4   name        2410 non-null   object
 5   style       2405 non-null   object
 6   brewery_id  2410 non-null   int64
 7   ounces      2410 non-null   float64
dtypes: float64(3), int64(3), object(2)
memory usage: 150.8+ KB

In [16]:
df.describe()

,Unnamed: 0,abv,ibu,id,brewery_id,ounces
count,2410.000000,2348.000000,1405.000000,2410.000000,2410.000000,2410.000000
mean,1204.500000,0.059773,42.713167,1431.113278,231.749793,13.592241
std,695.851397,0.013542,25.954066,752.459975,157.685604,2.352204
min,0.000000,0.001000,4.000000,1.000000,0.000000,8.400000
25%,602.250000,0.050000,21.000000,808.250000,93.000000,12.000000
50%,1204.500000,0.056000,35.000000,1453.500000,205.000000,12.000000
75%,1806.750000,0.067000,64.000000,2075.750000,366.000000,16.000000
max,2409.000000,0.128000,138.000000,2692.000000,557.000000,32.000000


* A short description of the content of the data
* One or two possible business uses of the data
* The location (URL) of the dataset
* A summary of the characteristics of the dataset using the describe() function in pandas

In [30]:
KAGGLE_API_TOKEN='KGAT_e58e911985ec215925c20d9dd62e057e'

In [28]:
import os

In [32]:
os.environ['KAGGLE_USERNAME'] = 'davidharrisnet'
os.environ['KAGGLE_KEY'] = KAGGLE_API_TOKEN

In [22]:
filename = '../data/property_sales/raw_sales.csv'
data = pd.read_csv(filename)

In [23]:
df = pd.DataFrame(data)

In [24]:
df.head()

              datesold  postcode   price propertyType  bedrooms
0  2007-02-07 00:00:00      2607  525000        house         4
1  2007-02-27 00:00:00      2906  290000        house         3
2  2007-03-07 00:00:00      2905  328000        house         3
3  2007-03-09 00:00:00      2905  380000        house         4
4  2007-03-21 00:00:00      2906  310000        house         3

In [26]:
filename = '../data/property_sales/ma_lga_12345.csv'
data = pd.read_csv(filename)

In [27]:
df = pd.DataFrame(data)
df.head()

     saledate      MA   type  bedrooms
0  30/09/2007  441854  house         2
1  31/12/2007  441854  house         2
2  31/03/2008  441854  house         2
3  30/06/2008  441854  house         2
4  30/09/2008  451583  house         2

In [33]:
import kagglehub

In [38]:

# Download latest version
path = kagglehub.dataset_download("yasunorim/mlb-bat-tracking-2024-2025")

print("Path to dataset files:", path)

Path to dataset files: C:\Users\Bilbo\.cache\kagglehub\datasets\yasunorim\mlb-bat-tracking-2024-2025\versions\1

In [48]:
import os

filepath = path + os.sep + 'mlb_bat_tracking_2024_2025.csv'

In [50]:
filepath
data = pd.read_csv(filepath)

In [51]:
df = pd.DataFrame(data)
df.head()

,id,name,swings_competitive,percent_swings_competitive,contact,avg_bat_speed,hard_swing_rate,squared_up_per_bat_contact,squared_up_per_swing,blast_per_bat_contact,blast_per_swing,swing_length,swords,batter_run_value,whiffs,whiff_per_swing,batted_ball_events,batted_ball_event_per_swing,season
0,665833,"Cruz, Oneil",818,0.905869,553,78.789158,0.783619,0.323689,0.218826,0.247740,0.167482,7.760678,19,-21.060730,265,0.323961,271,0.331296,2024
1,691406,"Caminero, Junior",1090,0.906822,839,78.539182,0.811009,0.290822,0.223853,0.224076,0.172477,8.417281,21,2.374002,251,0.230275,427,0.391743,2024
2,691023,"Walker, Jordan",686,0.905013,465,78.069258,0.778426,0.266667,0.180758,0.200000,0.135569,8.258906,21,-19.146261,221,0.322157,231,0.336735,2024
3,666176,"Adell, Jo",1032,0.902887,779,77.613888,0.733527,0.261874,0.197674,0.191271,0.144380,7.728556,30,0.667368,253,0.245155,354,0.343023,2024
4,656941,"Schwarber, Kyle",1138,0.900316,807,77.316245,0.770650,0.322181,0.228471,0.246592,0.174868,7.530870,51,11.199153,331,0.290861,385,0.338313,2024

In [52]:
import kagglehub

# Download latest version
path = kagglehub.dataset_download("jenyraja/housing-price")

print("Path to dataset files:", path)

Downloading to C:\Users\Bilbo\.cache\kagglehub\datasets\jenyraja\housing-price\1.archive...

100%|█████████████████████████████████████████████████████████████████████████████| 4.63k/4.63k [00:00<00:00, 2.37MB/s]

Extracting files...
Path to dataset files: C:\Users\Bilbo\.cache\kagglehub\datasets\jenyraja\housing-price\versions\1

In [175]:
filepath = path + os.sep + 'Housing.csv'

In [174]:
data = pd.read_csv(filepath)

In [176]:
df = pd.DataFrame(data)
df.head()

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
0,13300000,7420,4,2,3,yes,no,no,no,yes,2,yes,furnished
1,12250000,8960,4,4,4,yes,no,no,no,yes,3,no,furnished
2,12250000,9960,3,2,2,yes,no,yes,no,no,2,yes,semi-furnished
3,12215000,7500,4,2,2,yes,no,yes,no,yes,3,yes,furnished
4,11410000,7420,4,1,2,yes,yes,yes,no,yes,2,no,furnished

In [177]:
df.describe()

,price,area,bedrooms,bathrooms,stories,parking
count,5.450000e+02,545.000000,545.000000,545.000000,545.000000,545.000000
mean,4.766729e+06,5150.541284,2.965138,1.286239,1.805505,0.693578
std,1.870440e+06,2170.141023,0.738064,0.502470,0.867492,0.861586
min,1.750000e+06,1650.000000,1.000000,1.000000,1.000000,0.000000
25%,3.430000e+06,3600.000000,2.000000,1.000000,1.000000,0.000000
50%,4.340000e+06,4600.000000,3.000000,1.000000,2.000000,0.000000
75%,5.740000e+06,6360.000000,3.000000,2.000000,2.000000,1.000000
max,1.330000e+07,16200.000000,6.000000,4.000000,4.000000,3.000000

In [162]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 545 entries, 0 to 544
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   price             545 non-null    int64
 1   area              545 non-null    int64
 2   bedrooms          545 non-null    int64
 3   bathrooms         545 non-null    int64
 4   stories           545 non-null    int64
 5   mainroad          545 non-null    object
 6   guestroom         545 non-null    object
 7   basement          545 non-null    object
 8   hotwaterheating   545 non-null    object
 9   airconditioning   545 non-null    object
 10  parking           545 non-null    int64
 11  prefarea          545 non-null    object
 12  furnishingstatus  545 non-null    object
dtypes: int64(6), object(7)
memory usage: 55.5+ KB

In [163]:
price = df[['price']]

In [165]:
price.mean()

price    4.766729e+06
dtype: float64

In [167]:
price.max()

price    13300000
dtype: int64

In [172]:
price.std()

price    1.870440e+06
dtype: float64

In [170]:
price.head()

      price
0  13300000
1  12250000
2  12250000
3  12215000
4  11410000

In [171]:
price.tail()

       price
540  1820000
541  1767150
542  1750000
543  1750000
544  1750000

In [173]:
df.isnull().sum()

price               0
area                0
bedrooms            0
bathrooms           0
stories             0
mainroad            0
guestroom           0
basement            0
hotwaterheating     0
airconditioning     0
parking             0
prefarea            0
furnishingstatus    0
dtype: int64


* A short description of the content of the data
* One or two possible business uses of the data
* The location (URL) of the dataset
* A summary of the characteristics of the dataset using the describe() function in pandas

# Craft Beer

In [78]:
def dataframe(path):
     data = pd.read_csv(filepath)
     df = pd.DataFrame(data)
   
     return df

In [178]:
filepath = "../data/beer/beers.csv"
dfbeer = dataframe(filepath)
dfbeer.head()

,Unnamed: 0,abv,ibu,id,name,style,brewery_id,ounces
0,0,0.050,NaN,1436,Pub Beer,American Pale Lager,408,12.0
1,1,0.066,NaN,2265,Devil's Cup,American Pale Ale (APA),177,12.0
2,2,0.071,NaN,2264,Rise of the Phoenix,American IPA,177,12.0
3,3,0.090,NaN,2263,Sinister,American Double / Imperial IPA,177,12.0
4,4,0.075,NaN,2262,Sex and Candy,American IPA,177,12.0

In [179]:

dfbeer.describe()

,Unnamed: 0,abv,ibu,id,brewery_id,ounces
count,2410.000000,2348.000000,1405.000000,2410.000000,2410.000000,2410.000000
mean,1204.500000,0.059773,42.713167,1431.113278,231.749793,13.592241
std,695.851397,0.013542,25.954066,752.459975,157.685604,2.352204
min,0.000000,0.001000,4.000000,1.000000,0.000000,8.400000
25%,602.250000,0.050000,21.000000,808.250000,93.000000,12.000000
50%,1204.500000,0.056000,35.000000,1453.500000,205.000000,12.000000
75%,1806.750000,0.067000,64.000000,2075.750000,366.000000,16.000000
max,2409.000000,0.128000,138.000000,2692.000000,557.000000,32.000000

In [180]:
dfbeer.isnull().sum()

Unnamed: 0       0
abv             62
ibu           1005
id               0
name             0
style            5
brewery_id       0
ounces           0
dtype: int64

In [110]:
dfbeer[dfbeer['style'].str.contains('stout', case=False) ]

,Unnamed: 0,abv,ibu,id,name,style,brewery_id,ounces
5,5,0.077,,2261,Black Exodus,Oatmeal Stout,177,12.0
23,23,0.079,,976,Marooned On Hog Island,American Stout,368,12.0
71,71,0.077,25.0,2684,35 K,Milk / Sweet Stout,1,16.0
82,82,0.053,35.0,1594,Maylani's Coconut Stout,American Stout,367,16.0
105,105,0.057,13.0,1520,Barney Flats Oatmeal Stout,Oatmeal Stout,171,12.0
...,...,...,...,...,...,...,...,...
2332,2332,0.07,,2222,10 Ton,Oatmeal Stout,94,16.0
2347,2347,,,2344,O’Malley’s Stout,English Stout,132,12.0
2367,2367,0.06,23.0,366,Jack Stout,Oatmeal Stout,361,12.0
2374,2374,0.054,,826,Mystical Stout,Irish Dry Stout,499,16.0
2404,2404,0.075,,1035,Rocky Mountain Oyster Stout,American Stout,424,12.0

In [148]:
filepath = "../data/beer/breweries.csv"
dfbrew = dataframe(filepath)
dfbrew.head()

   Unnamed: 0                       name           city state
0           0         NorthGate Brewing     Minneapolis    MN
1           1  Against the Grain Brewery     Louisville    KY
2           2   Jack's Abby Craft Lagers     Framingham    MA
3           3  Mike Hess Brewing Company      San Diego    CA
4           4    Fort Point Beer Company  San Francisco    CA

In [154]:
dfbrew[dfbrew['city'].str.contains('Chicago', case=False) ]

     Unnamed: 0                          name     city state
44           44    Revolution Brewing Company  Chicago    IL
52           52     Pipeworks Brewing Company  Chicago    IL
64           64      SlapShot Brewing Company  Chicago    IL
65           65            Mikerphone Brewing  Chicago    IL
88           88  Goose Island Brewing Company  Chicago    IL
175         175      Spiteful Brewing Company  Chicago    IL
196         196  Goose Island Brewery Company  Chicago    IL
256         256          Finch's Beer Company  Chicago    IL
327         327        Half Acre Beer Company  Chicago    IL

In [183]:
# bracket selection
dfbeer['id'].head()

0    1436
1    2265
2    2264
3    2263
4    2262
Name: id, dtype: int64

In [185]:
dfbeer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2410 entries, 0 to 2409
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  2410 non-null   int64
 1   abv         2348 non-null   float64
 2   ibu         1405 non-null   float64
 3   id          2410 non-null   int64
 4   name        2410 non-null   object
 5   style       2405 non-null   object
 6   brewery_id  2410 non-null   int64
 7   ounces      2410 non-null   float64
dtypes: float64(3), int64(3), object(2)
memory usage: 150.8+ KB

In [187]:
dfbeer[['abv','ibu']]

        abv   ibu
0     0.050   NaN
1     0.066   NaN
2     0.071   NaN
3     0.090   NaN
4     0.075   NaN
...     ...   ...
2405  0.067  45.0
2406  0.052   NaN
2407  0.055   NaN
2408  0.055  40.0
2409  0.052   NaN

[2410 rows x 2 columns]

In [190]:
dfbeer[1:8]

,Unnamed: 0,abv,ibu,id,name,style,brewery_id,ounces
1,1,0.066,NaN,2265,Devil's Cup,American Pale Ale (APA),177,12.0
2,2,0.071,NaN,2264,Rise of the Phoenix,American IPA,177,12.0
3,3,0.090,NaN,2263,Sinister,American Double / Imperial IPA,177,12.0
4,4,0.075,NaN,2262,Sex and Candy,American IPA,177,12.0
5,5,0.077,NaN,2261,Black Exodus,Oatmeal Stout,177,12.0
6,6,0.045,NaN,2260,Lake Street Express,American Pale Ale (APA),177,12.0
7,7,0.065,NaN,2259,Foreman,American Porter,177,12.0

In [192]:
dfbeer['abv'] > 0.04

0       True
1       True
2       True
3       True
4       True
        ...
2405    True
2406    True
2407    True
2408    True
2409    True
Name: abv, Length: 2410, dtype: bool

In [193]:
dfbeer[dfbeer['abv'] > 0.04]

,Unnamed: 0,abv,ibu,id,name,style,brewery_id,ounces
0,0,0.050,NaN,1436,Pub Beer,American Pale Lager,408,12.0
1,1,0.066,NaN,2265,Devil's Cup,American Pale Ale (APA),177,12.0
2,2,0.071,NaN,2264,Rise of the Phoenix,American IPA,177,12.0
3,3,0.090,NaN,2263,Sinister,American Double / Imperial IPA,177,12.0
4,4,0.075,NaN,2262,Sex and Candy,American IPA,177,12.0
...,...,...,...,...,...,...,...,...
2405,2405,0.067,45.0,928,Belgorado,Belgian IPA,424,12.0
2406,2406,0.052,NaN,807,Rail Yard Ale,American Amber / Red Ale,424,12.0
2407,2407,0.055,NaN,620,B3K Black Lager,Schwarzbier,424,12.0
2408,2408,0.055,40.0,145,Silverback Pale Ale,American Pale Ale (APA),424,12.0
2409,2409,0.052,NaN,84,Rail Yard Ale (2009),American Amber / Red Ale,424,12.0

In [198]:
dfbeer.loc[4]

Unnamed: 0                4
abv                   0.075
ibu                     NaN
id                     2262
name          Sex and Candy
style          American IPA
brewery_id              177
ounces                 12.0
Name: 4, dtype: object

In [199]:
dfbeer.loc[4:9]

,Unnamed: 0,abv,ibu,id,name,style,brewery_id,ounces
4,4,0.075,NaN,2262,Sex and Candy,American IPA,177,12.0
5,5,0.077,NaN,2261,Black Exodus,Oatmeal Stout,177,12.0
6,6,0.045,NaN,2260,Lake Street Express,American Pale Ale (APA),177,12.0
7,7,0.065,NaN,2259,Foreman,American Porter,177,12.0
8,8,0.055,NaN,2258,Jade,American Pale Ale (APA),177,12.0
9,9,0.086,NaN,2131,Cone Crusher,American Double / Imperial IPA,177,12.0

In [240]:
dfbeer.loc[1:1]

,Unnamed: 0,abv,ibu,id,name,style,brewery_id,ounces
1,1,0.066,NaN,2265,Devil's Cup,American Pale Ale (APA),177,12.0

In [200]:
dfbeer.loc[4:9,'abv']

4    0.075
5    0.077
6    0.045
7    0.065
8    0.055
9    0.086
Name: abv, dtype: float64

In [245]:
dfbeer.loc[1,'abv']

0.066

In [208]:
dfbeer.loc[4:9,['abv','ibu']]

     abv  ibu
4  0.075  NaN
5  0.077  NaN
6  0.045  NaN
7  0.065  NaN
8  0.055  NaN
9  0.086  NaN

In [209]:
dfbeer.loc[[4,9],['abv','ibu']]

     abv  ibu
4  0.075  NaN
9  0.086  NaN

In [201]:
dfbeer.loc[[1,3,6,7]]

,Unnamed: 0,abv,ibu,id,name,style,brewery_id,ounces
1,1,0.066,NaN,2265,Devil's Cup,American Pale Ale (APA),177,12.0
3,3,0.090,NaN,2263,Sinister,American Double / Imperial IPA,177,12.0
6,6,0.045,NaN,2260,Lake Street Express,American Pale Ale (APA),177,12.0
7,7,0.065,NaN,2259,Foreman,American Porter,177,12.0

In [221]:

dfbeer.iloc[3,3]

2263

In [227]:
dfbeer.iloc[:10,3:5]

     id                 name
0  1436             Pub Beer
1  2265          Devil's Cup
2  2264  Rise of the Phoenix
3  2263             Sinister
4  2262        Sex and Candy
5  2261         Black Exodus
6  2260  Lake Street Express
7  2259              Foreman
8  2258                 Jade
9  2131         Cone Crusher

In [210]:
dfbeer.loc[ dfbeer['abv']>0.066]

,Unnamed: 0,abv,ibu,id,name,style,brewery_id,ounces
2,2,0.071,NaN,2264,Rise of the Phoenix,American IPA,177,12.0
3,3,0.090,NaN,2263,Sinister,American Double / Imperial IPA,177,12.0
4,4,0.075,NaN,2262,Sex and Candy,American IPA,177,12.0
5,5,0.077,NaN,2261,Black Exodus,Oatmeal Stout,177,12.0
9,9,0.086,NaN,2131,Cone Crusher,American Double / Imperial IPA,177,12.0
...,...,...,...,...,...,...,...,...
2398,2398,0.077,30.0,1513,Lights Out Vanilla Cream Extra Stout,American Double / Imperial IPA,199,12.0
2399,2399,0.069,69.0,1512,Worthy IPA (2013),American IPA,199,12.0
2402,2402,0.082,NaN,1316,Colorojo Imperial Red Ale,American Strong Ale,424,12.0
2404,2404,0.075,NaN,1035,Rocky Mountain Oyster Stout,American Stout,424,12.0
2405,2405,0.067,45.0,928,Belgorado,Belgian IPA,424,12.0

In [213]:
dfbeer.loc[ dfbeer['abv']>0.066, ['name', 'style']]

                                      name                           style
2                      Rise of the Phoenix                    American IPA
3                                 Sinister  American Double / Imperial IPA
4                            Sex and Candy                    American IPA
5                             Black Exodus                   Oatmeal Stout
9                             Cone Crusher  American Double / Imperial IPA
...                                    ...                             ...
2398  Lights Out Vanilla Cream Extra Stout  American Double / Imperial IPA
2399                     Worthy IPA (2013)                    American IPA
2402             Colorojo Imperial Red Ale             American Strong Ale
2404           Rocky Mountain Oyster Stout                  American Stout
2405                             Belgorado                     Belgian IPA

[610 rows x 2 columns]

In [229]:
dfbeer.iloc[:-1, :]

,Unnamed: 0,abv,ibu,id,name,style,brewery_id,ounces
0,0,0.050,NaN,1436,Pub Beer,American Pale Lager,408,12.0
1,1,0.066,NaN,2265,Devil's Cup,American Pale Ale (APA),177,12.0
2,2,0.071,NaN,2264,Rise of the Phoenix,American IPA,177,12.0
3,3,0.090,NaN,2263,Sinister,American Double / Imperial IPA,177,12.0
4,4,0.075,NaN,2262,Sex and Candy,American IPA,177,12.0
...,...,...,...,...,...,...,...,...
2404,2404,0.075,NaN,1035,Rocky Mountain Oyster Stout,American Stout,424,12.0
2405,2405,0.067,45.0,928,Belgorado,Belgian IPA,424,12.0
2406,2406,0.052,NaN,807,Rail Yard Ale,American Amber / Red Ale,424,12.0
2407,2407,0.055,NaN,620,B3K Black Lager,Schwarzbier,424,12.0
2408,2408,0.055,40.0,145,Silverback Pale Ale,American Pale Ale (APA),424,12.0

In [233]:
dfbeer.iloc[[1]]

,Unnamed: 0,abv,ibu,id,name,style,brewery_id,ounces
1,1,0.066,NaN,2265,Devil's Cup,American Pale Ale (APA),177,12.0

In [243]:
dfbeer.iloc[:1]

,Unnamed: 0,abv,ibu,id,name,style,brewery_id,ounces
0,0,0.05,NaN,1436,Pub Beer,American Pale Lager,408,12.0

In [244]:
dfbeer.iloc[:, 0]

0          0
1          1
2          2
3          3
4          4
        ...
2405    2405
2406    2406
2407    2407
2408    2408
2409    2409
Name: Unnamed: 0, Length: 2410, dtype: int64

In [1]:
import sklearn

ModuleNotFoundError: No module named 'sklearn'